ArcaneNibble/efm32-unified-crate/svd/EFM32HG.tmpl.svd
#if !defined(FLASH_32) && !defined(FLASH_64)
  #warning "Need to define flash size"
  #define FLASH_64
#endif

#if defined(EFM32HG350)
  #define HAVE_USB
  #define HAVE_AES
  #define SRAM_8
  #ifdef FLASH_64
    #define DEVICE_NAME EFM32HG350F64
  #else
    #define DEVICE_NAME EFM32HG350F32
  #endif
#elif defined(EFM32HG322)
  #define HAVE_USB
  #define HAVE_AES
  #define SRAM_8
  #ifdef FLASH_64
    #define DEVICE_NAME EFM32HG322F64
  #else
    #define DEVICE_NAME EFM32HG322F32
  #endif
#elif defined(EFM32HG321)
  #define HAVE_USB
  #define SRAM_8
  #ifdef FLASH_64
    #define DEVICE_NAME EFM32HG321F64
  #else
    #define DEVICE_NAME EFM32HG321F32
  #endif
#elif defined(EFM32HG310)
  #define HAVE_USB
  #define HAVE_AES
  #define SRAM_8
  #ifdef FLASH_64
    #define DEVICE_NAME EFM32HG310F64
  #else
    #define DEVICE_NAME EFM32HG310F32
  #endif
#elif defined(EFM32HG309)
  #define HAVE_USB
  #define HAVE_AES
  #define SRAM_8
  #ifdef FLASH_64
    #define DEVICE_NAME EFM32HG309F64
  #else
    #define DEVICE_NAME EFM32HG309F32
  #endif
#elif defined(EFM32HG222)
  #define HAVE_AES
  #ifdef FLASH_64
    #define SRAM_8
    #define DEVICE_NAME EFM32HG222F64
  #else
    #define SRAM_4
    #define DEVICE_NAME EFM32HG222F32
  #endif
#else
  #error "Unsupported device"
#endif

<?xml version="1.0" encoding="utf-8"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.0" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1.0.xsd">
  <name>DEVICE_NAME</name>
  <version>5.4.0</version>
  <description>Silicon Labs DEVICE_NAME Cortex-M MCU</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
#ifdef HAVE_AES
    <peripheral>
      <name>AES</name>
      <version>5.4.0</version>
      <description>AES</description>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <value>16</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000071</resetMask>
          <fields>
            <field>
              <name>DECRYPT</name>
              <description>Decryption/Encryption Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATASTART</name>
              <description>AES_DATA Write Start</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XORSTART</name>
              <description>AES_XORDATA Write Start</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTEORDER</name>
              <description>Configure byte order in data and key registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Encryption/Decryption Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Encryption/Decryption Stop</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RUNNING</name>
              <description>AES Running</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>Encryption/Decryption Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>Encryption/Decryption Done Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS</name>
          <description>Interrupt Flag Set Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>Encryption/Decryption Done Interrupt Flag Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>Encryption/Decryption Done Interrupt Flag Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XORDATA</name>
          <description>XORDATA Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>XORDATA</name>
              <description>XOR Data Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYLA</name>
          <description>KEY Low Register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>KEYLA</name>
              <description>Key Low Access A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYLB</name>
          <description>KEY Low Register</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>KEYLB</name>
              <description>Key Low Access B</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYLC</name>
          <description>KEY Low Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>KEYLC</name>
              <description>Key Low Access C</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYLD</name>
          <description>KEY Low Register</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>KEYLD</name>
              <description>Key Low Access D</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
